# Exercice 1 

Reproduisez le tutoriel en le traduisant (y compris au niveau
du code) en Français jusqu’à la section Reshaping (inclus - Vous vous arrêterez avant la partie Time Series).

URL: http://pandas.pydata.org/pandas-docs/stable/10min.html

# 10 minutes pour apprendre Pandas

In [2]:
## importation des fichiers 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Creation d'objet

création de serie:

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Création d'un DataFrame en utilisant un tableau numpy, avec un index datetime et des colonnes étiquetées:

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-04  0.118111  1.460192 -0.280312 -0.768921
2013-01-05 -0.517096  0.661949  0.455395 -1.432581
2013-01-06 -0.933948 -0.464038  0.112911  1.018374

Création d'un DataFrame en utilisant un dict d'objets qui peuvent être convertis en séries.

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Avoir des dtypes specific

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython, l'achèvement des tabulations (tab complexion) pour les noms de colonnes (ainsi que les attributs publics) est automatiquement activé. Voici un sous-ensemble des attributs qui seront complétés:

 df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

Comme vous pouvez le voir, les colonnes A, B, C et D sont automatiquement complétées. E aussi d'ailleurs; le reste des attributs a été tronqué par souci de concision.

# Visualisation des données

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-04  0.118111  1.460192 -0.280312 -0.768921
2013-01-05 -0.517096  0.661949  0.455395 -1.432581

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.118111  1.460192 -0.280312 -0.768921
2013-01-05 -0.517096  0.661949  0.455395 -1.432581
2013-01-06 -0.933948 -0.464038  0.112911  1.018374

Afficher l'index, les colonnes et les données numériques (numpy data) sous-jacentes

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
 df.values

array([[ 0.65917071, -1.17706842,  1.20663045, -0.00159453],
       [ 0.97100667,  0.46657375, -0.47619445,  0.85766294],
       [ 0.12627934, -0.63941361, -1.29064391,  0.37164355],
       [ 0.11811065,  1.46019228, -0.28031244, -0.76892148],
       [-0.51709576,  0.66194889,  0.45539542, -1.43258135],
       [-0.93394809, -0.46403776,  0.11291075,  1.01837378]])

afficher un résumé rapide au niveau statistique (summary) de vos données -> on utilise describe

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.070587  0.051366 -0.045369  0.007430
std    0.709508  0.977944  0.852624  0.954357
min   -0.933948 -1.177068 -1.290644 -1.432581
25%   -0.358294 -0.595570 -0.427224 -0.577090
50%    0.122195  0.001268 -0.083701  0.185025
75%    0.525948  0.613105  0.369774  0.736158
max    0.971007  1.460192  1.206630  1.018374

Transposer vos données -> T

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.659171    0.971007    0.126279    0.118111   -0.517096   -0.933948
B   -1.177068    0.466574   -0.639414    1.460192    0.661949   -0.464038
C    1.206630   -0.476194   -1.290644   -0.280312    0.455395    0.112911
D   -0.001595    0.857663    0.371644   -0.768921   -1.432581    1.018374

 trier par un axe : -> axis =1 (A,B,C,D)
                       axis = 0 (dates) 
 l'exemple suivant est descendant

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.001595  1.206630 -1.177068  0.659171
2013-01-02  0.857663 -0.476194  0.466574  0.971007
2013-01-03  0.371644 -1.290644 -0.639414  0.126279
2013-01-04 -0.768921 -0.280312  1.460192  0.118111
2013-01-05 -1.432581  0.455395  0.661949 -0.517096
2013-01-06  1.018374  0.112911 -0.464038 -0.933948

In [16]:
df

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-04  0.118111  1.460192 -0.280312 -0.768921
2013-01-05 -0.517096  0.661949  0.455395 -1.432581
2013-01-06 -0.933948 -0.464038  0.112911  1.018374

tri par valeurs

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-06 -0.933948 -0.464038  0.112911  1.018374
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-05 -0.517096  0.661949  0.455395 -1.432581
2013-01-04  0.118111  1.460192 -0.280312 -0.768921

# selection

Remarque :  Bien que les expressions Python / Numpy standard pour la sélection et le paramétrage soient intuitives et pratiques pour le travail interactif, pour le code de production, nous recommandons les méthodes d'accès aux données pandas optimisées, .at, .iat, .loc, .iloc et .ix.

# getting

Sélection d'une seule colonne, qui donne une série, équivalent à df.A.

In [18]:
df['A']

2013-01-01    0.659171
2013-01-02    0.971007
2013-01-03    0.126279
2013-01-04    0.118111
2013-01-05   -0.517096
2013-01-06   -0.933948
Freq: D, Name: A, dtype: float64

slicing

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644

In [20]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-04  0.118111  1.460192 -0.280312 -0.768921

Selection par label

section transversale en utilisant une étiquette

In [21]:
df.loc[dates[0]]

A    0.659171
B   -1.177068
C    1.206630
D   -0.001595
Name: 2013-01-01 00:00:00, dtype: float64

Sélection sur un multi-axe par étiquette

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.659171 -1.177068
2013-01-02  0.971007  0.466574
2013-01-03  0.126279 -0.639414
2013-01-04  0.118111  1.460192
2013-01-05 -0.517096  0.661949
2013-01-06 -0.933948 -0.464038

Slicing, les deux points de terminaison sont inclus

In [23]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.971007  0.466574
2013-01-03  0.126279 -0.639414
2013-01-04  0.118111  1.460192


Réduction des dimensions de l'objet retourné

In [24]:
df.loc['20130102',['A','B']]

A    0.971007
B    0.466574
Name: 2013-01-02 00:00:00, dtype: float64

pour avoir un scalaire

In [25]:
df.loc[dates[0],'A']

0.6591707091973379

pour avoir un acces rapide à un scalaire

In [26]:
df.at[dates[0],'A']

0.6591707091973379

# Selection par position

In [27]:
#avec des entiers
df.iloc[3]

A    0.118111
B    1.460192
C   -0.280312
D   -0.768921
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
# avec des slices d'entier
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.118111  1.460192
2013-01-05 -0.517096  0.661949

In [29]:
# avec les position 
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.971007 -0.476194
2013-01-03  0.126279 -1.290644
2013-01-05 -0.517096  0.455395

In [30]:
 df.iloc[1:3,:]#row

                   A         B         C         D
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644

In [31]:
df.iloc[:,1:3]#columns

                   B         C
2013-01-01 -1.177068  1.206630
2013-01-02  0.466574 -0.476194
2013-01-03 -0.639414 -1.290644
2013-01-04  1.460192 -0.280312
2013-01-05  0.661949  0.455395
2013-01-06 -0.464038  0.112911

In [32]:
df.iloc[1,1] #valeur explicite

0.4665737530636579

In [33]:
df.iat[1,1] #plus rapide

0.4665737530636579

# Indexation booléenne

Utilisation des valeurs d'une seule colonne pour sélectionner des données

In [34]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.659171 -1.177068  1.206630 -0.001595
2013-01-02  0.971007  0.466574 -0.476194  0.857663
2013-01-03  0.126279 -0.639414 -1.290644  0.371644
2013-01-04  0.118111  1.460192 -0.280312 -0.768921

Selecting values from a DataFrame where a boolean condition is met.

In [35]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.659171       NaN  1.206630       NaN
2013-01-02  0.971007  0.466574       NaN  0.857663
2013-01-03  0.126279       NaN       NaN  0.371644
2013-01-04  0.118111  1.460192       NaN       NaN
2013-01-05       NaN  0.661949  0.455395       NaN
2013-01-06       NaN       NaN  0.112911  1.018374

Utilisation de la méthode isin () pour le filtrage

In [36]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.659171 -1.177068  1.206630 -0.001595    one
2013-01-02  0.971007  0.466574 -0.476194  0.857663    one
2013-01-03  0.126279 -0.639414 -1.290644  0.371644    two
2013-01-04  0.118111  1.460192 -0.280312 -0.768921  three
2013-01-05 -0.517096  0.661949  0.455395 -1.432581   four
2013-01-06 -0.933948 -0.464038  0.112911  1.018374  three

In [37]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.126279 -0.639414 -1.290644  0.371644   two
2013-01-05 -0.517096  0.661949  0.455395 -1.432581  four

# Setting

La définition d'une nouvelle colonne aligne automatiquement les données par les index

In [38]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df['F'] = s1

 Définition des valeurs par libellé (label)

In [40]:
df.at[dates[0],'A'] = 0

definition des valeurs par position

In [41]:
df.iat[0,1] = 0

Réglage par affectation avec un tableau numpy

In [42]:
 df.loc[:,'D'] = np.array([5] * len(df))

resultat des opérations antérieures

In [43]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.206630  5  NaN
2013-01-02  0.971007  0.466574 -0.476194  5  1.0
2013-01-03  0.126279 -0.639414 -1.290644  5  2.0
2013-01-04  0.118111  1.460192 -0.280312  5  3.0
2013-01-05 -0.517096  0.661949  0.455395  5  4.0
2013-01-06 -0.933948 -0.464038  0.112911  5  5.0

une opération where avec parametrage

In [44]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.206630 -5  NaN
2013-01-02 -0.971007 -0.466574 -0.476194 -5 -1.0
2013-01-03 -0.126279 -0.639414 -1.290644 -5 -2.0
2013-01-04 -0.118111 -1.460192 -0.280312 -5 -3.0
2013-01-05 -0.517096 -0.661949 -0.455395 -5 -4.0
2013-01-06 -0.933948 -0.464038 -0.112911 -5 -5.0

# Donnés manquantes

donnés manquantes : np.nan

La réindexation permet de modifier / ajouter / supprimer l'index sur un axe spécifié. Cela renvoie une copie des données.

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [46]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [47]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.206630  5  NaN  1.0
2013-01-02  0.971007  0.466574 -0.476194  5  1.0  1.0
2013-01-03  0.126279 -0.639414 -1.290644  5  2.0  NaN
2013-01-04  0.118111  1.460192 -0.280312  5  3.0  NaN

Pour supprimer des lignes contenant des données manquantes

In [48]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.971007  0.466574 -0.476194  5  1.0  1.0

Remplir les données manquantes

In [49]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.206630  5  5.0  1.0
2013-01-02  0.971007  0.466574 -0.476194  5  1.0  1.0
2013-01-03  0.126279 -0.639414 -1.290644  5  2.0  5.0
2013-01-04  0.118111  1.460192 -0.280312  5  3.0  5.0

Pour obtenir le masque booléen où les valeurs sont 'nan'

In [50]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operation

Stats


Les opérations en général excluent les données manquantes.

In [51]:
df.mean()

A   -0.039275
B    0.247544
C   -0.045369
D    5.000000
F    3.000000
dtype: float64

même opération pour l'autre axes

In [52]:
df.mean(1)

2013-01-01    1.551658
2013-01-02    1.392277
2013-01-03    1.039244
2013-01-04    1.859598
2013-01-05    1.920050
2013-01-06    1.742985
Freq: D, dtype: float64

Opérer avec des objets de dimension différente et nécessitant un alignement. En outre, pandas diffuse automatiquement le long de la dimension spécifiée.

In [53]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [54]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.873721 -1.639414 -2.290644  4.0  1.0
2013-01-04 -2.881889 -1.539808 -3.280312  2.0  0.0
2013-01-05 -5.517096 -4.338051 -4.544605  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# application 

application des fonctions aux données

In [55]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.206630   5   NaN
2013-01-02  0.971007  0.466574  0.730436  10   1.0
2013-01-03  1.097286 -0.172840 -0.560208  15   3.0
2013-01-04  1.215397  1.287352 -0.840520  20   6.0
2013-01-05  0.698301  1.949301 -0.385125  25  10.0
2013-01-06 -0.235647  1.485264 -0.272214  30  15.0

In [56]:
df.apply(lambda x: x.max() - x.min())

A    1.904955
B    2.099606
C    2.497274
D    0.000000
F    4.000000
dtype: float64

# histogramming

In [57]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    6
2    5
3    5
4    6
5    6
6    4
7    2
8    4
9    6
dtype: int32

In [58]:
s.value_counts()

6    5
5    2
4    2
2    1
dtype: int64

# string méthodes

Series est équipé d'un ensemble de méthodes de traitement de chaîne dans l'attribut str qui le rendent facile à utiliser sur chaque élément du tableau, comme dans l'extrait de code ci-dessous. 
Notez que pattern-matching dans str utilise généralement des expressions régulières par défaut (et dans certains cas les utilise toujours).

In [59]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Fusion 

Concat 


pandas facilites des objets Series, DataFrame et Panel avec différents types de logique d'ensemble pour les index et la fonctionnalité d'algèbre relationnelle dans le cas d'opérations de type join / merge.

On conncate les objets pandas ensemble avec 'concat()'

In [60]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.130251  0.116911  0.095928 -0.664922
1  1.306196  0.611780 -0.579552 -1.759766
2 -0.948293  0.618606 -1.272078 -0.790561
3  0.357422 -0.306362  0.365330 -0.507520
4  0.470072  2.904815  2.086208  0.510308
5  0.228292  1.305873 -1.456669  0.392142
6  0.301210  0.815940  1.081982 -0.732152
7 -0.913938  0.618264  0.745490 -0.626164
8 -0.037410 -1.090700  0.555884  0.461034
9  3.436188 -1.595634 -2.707796 -0.231903

In [61]:
pieces = [df[:3], df[3:7], df[7:]] #sépare en differents morceaux

In [62]:
pd.concat(pieces)

          0         1         2         3
0  0.130251  0.116911  0.095928 -0.664922
1  1.306196  0.611780 -0.579552 -1.759766
2 -0.948293  0.618606 -1.272078 -0.790561
3  0.357422 -0.306362  0.365330 -0.507520
4  0.470072  2.904815  2.086208  0.510308
5  0.228292  1.305873 -1.456669  0.392142
6  0.301210  0.815940  1.081982 -0.732152
7 -0.913938  0.618264  0.745490 -0.626164
8 -0.037410 -1.090700  0.555884  0.461034
9  3.436188 -1.595634 -2.707796 -0.231903

# Jointure
SQL fusionne (merge) les styles.

In [63]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [64]:
right

   key  rval
0  foo     4
1  foo     5

In [65]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Autre exemple :

In [66]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [67]:
right

   key  rval
0  foo     4
1  bar     5

In [68]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Ajout
Ajout d'une ligne à un DataFrame

In [69]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.391700 -0.350240 -0.903101  0.036656
1  1.754770 -0.001405 -0.270375 -0.437251
2 -1.336563  0.368085 -0.247462  0.043418
3  1.644448  0.132313  0.261379 -0.036991
4  0.445901  0.828023 -1.326846 -0.104827
5 -0.886990 -0.543998 -0.396618 -0.964621
6 -0.085619 -0.552654 -0.824785  0.892678
7  1.903689  0.087982 -0.947897 -0.760841

In [70]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.391700 -0.350240 -0.903101  0.036656
1  1.754770 -0.001405 -0.270375 -0.437251
2 -1.336563  0.368085 -0.247462  0.043418
3  1.644448  0.132313  0.261379 -0.036991
4  0.445901  0.828023 -1.326846 -0.104827
5 -0.886990 -0.543998 -0.396618 -0.964621
6 -0.085619 -0.552654 -0.824785  0.892678
7  1.903689  0.087982 -0.947897 -0.760841
8  1.644448  0.132313  0.261379 -0.036991

# Groupement

-> Divise les données par groupes en fonction de certains critères
-> Applique une fonction à chaque groupe indépendamment
-> Combine des résultats dans une structure de données

In [71]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.344359 -0.530127
1  bar    one -1.418952 -0.988417
2  foo    two  0.607439 -0.483330
3  bar  three -1.573791 -0.621690
4  foo    two -1.504633  0.280091
5  bar    two -0.213918 -2.277326
6  foo    one -1.340413 -0.279157
7  foo  three -0.267788  1.805372

Groupes et fait la somme des groupes :

In [72]:
df.groupby('A').sum()

            C         D
A
bar -3.206662 -3.887432
foo -2.849753  0.792849

groupement par colonnes multiples

In [73]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.418952 -0.988417
    three -1.573791 -0.621690
    two   -0.213918 -2.277326
foo one   -1.684772 -0.809285
    three -0.267788  1.805372
    two   -0.897194 -0.203238

# Remodelage

STACK

In [74]:
 tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.856590 -0.495787
      two    -1.364499  0.926364
baz   one    -1.248994  1.093616
      two     1.629956 -1.627559

la méthode stack () "compresse" les colonnes du DataFrame.

In [75]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.856590
               B   -0.495787
       two     A   -1.364499
               B    0.926364
baz    one     A   -1.248994
               B    1.093616
       two     A    1.629956
               B   -1.627559
dtype: float64

Avec un "DataFrame" ou une série "compressée " (ayant un MultiIndex dans l'index), l'opération inverse de stack () est unstack (), qui par défaut "décompresse"

In [85]:
stacked.unstack()

                     A         B
first second
bar   one     0.856590 -0.495787
      two    -1.364499  0.926364
baz   one    -1.248994  1.093616
      two     1.629956 -1.627559

In [86]:
stacked.unstack(1) // premier niveau

SyntaxError: invalid syntax (<ipython-input-86-78319b341436>, line 1)

In [87]:
stacked.unstack(0) // 2 eme niveau

SyntaxError: invalid syntax (<ipython-input-87-448a301d64b4>, line 1)

# tables de pivot

In [88]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [89]:
df

        A  B    C         D         E
0     one  A  foo -0.093514  0.523218
1     one  B  foo  0.549569 -2.034832
2     two  C  foo -0.341043  0.280073
3   three  A  bar  1.104867  0.578075
4     one  B  bar  1.334227  0.011450
5     one  C  bar  0.688038  0.805201
6     two  A  foo -0.050280 -0.523918
7   three  B  foo -0.025919  0.363655
8     one  C  foo  0.627709 -0.570906
9     one  A  bar -0.733637 -1.723403
10    two  B  bar  0.279067 -0.468658
11  three  C  bar  1.106965  0.684019

de manière très simple :

In [90]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.733637 -0.093514
      B  1.334227  0.549569
      C  0.688038  0.627709
three A  1.104867       NaN
      B       NaN -0.025919
      C  1.106965       NaN
two   A       NaN -0.050280
      B  0.279067       NaN
      C       NaN -0.341043